# Pandas- Handling missing or NaN values

# 1.NaN value
- The full form of NaN is Not a Number
- The purpose of NaN represent the missing values in Data
- The Data type of NaN is float
- While loading csv file if file having missing values then it will be considered  as NaN values.
- During data Analysis we need to handle these NaN values
      1. For example , suppose different users being surveyed may choose not to share their income some user may choose not to share the address in this way amny datasets went missing.

# None and NaN
- None : None is a python object which is holding nothing
- NaN : NaN is a pandas related object which represents missing data

## => Missing values
- During Data Collection Data can be miss
- This is very common Scenario
- NaN
- float

- python => Emptyvalue => None => Nonetype
- pandas => missing values => NaN => float

# 2. Creating a DataFrame by loading csv    file
- We can create DataFrame by loading csv file.
- The given file.csv file having missing values
- Kindly observe the missing / NaN values in DataFrame.

In [24]:
import pandas as pd
df=pd.read_csv("/Users/apple/Downloads/car_sales_data copy.csv")
df.info()
print(df.shape)
print("*"*50)
print(df.head())
print("*"*50)
print(df.tail())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Manufacturer  49955 non-null  object
 1   Model         49940 non-null  object
 2   Engine size   49960 non-null  float64
 3   Fuel type     49919 non-null  object
 4   Price         49950 non-null  float64
dtypes: float64(2), object(3)
memory usage: 1.9+ MB
(50000, 5)
**************************************************
  Manufacturer Model  Engine size Fuel type    Price
0         Ford   NaN          1.0    Petrol      NaN
1          NaN   NaN          4.0    Petrol      NaN
2          NaN   NaN          1.6       NaN  24072.0
3       Toyota  RAV4          1.8       NaN   1705.0
4           VW  Polo          1.0    Petrol   4101.0
**************************************************
      Manufacturer   Model  Engine size Fuel type     Price
49995          BMW      M5          5.0       NaN  113006.0
49996       Toyota   Prius          1.8       NaN    9430.0
49997         Ford  Mondeo          1.6       NaN   49852.0
49998         Ford   Focus          1.0    Diesel   23630.0
49999           VW    Golf          1.4    Diesel   10400.0

### 3. isna() and isnull() method - checkinhg NaN values
- isna() and isnull() are a predefined methods in DataFrame
- We can access these methods by using DataFrame object
- By using these methods we can check missing values exist in DataFrame or not
- if missing values are available then it returns as True , otherwise False

In [27]:
import pandas as pd
df=pd.read_csv("/Users/apple/Downloads/car_sales_data copy.csv")
print(df)
print("*"*50)
print(df.isnull())
print("*"*50)
print(df.isna())

      Manufacturer   Model  Engine size Fuel type     Price
0             Ford     NaN          1.0    Petrol       NaN
1              NaN     NaN          4.0    Petrol       NaN
2              NaN     NaN          1.6       NaN   24072.0
3           Toyota    RAV4          1.8       NaN    1705.0
4               VW    Polo          1.0    Petrol    4101.0
...            ...     ...          ...       ...       ...
49995          BMW      M5          5.0       NaN  113006.0
49996       Toyota   Prius          1.8       NaN    9430.0
49997         Ford  Mondeo          1.6       NaN   49852.0
49998         Ford   Focus          1.0    Diesel   23630.0
49999           VW    Golf          1.4    Diesel   10400.0

[50000 rows x 5 columns]
**************************************************
       Manufacturer  Model  Engine size  Fuel type  Price
0             False   True        False      False   True
1              True   True        False      False   True
2              True   True        False       True  False
3             False  False        False       True  False
4             False  False        False      False  False
...             ...    ...          ...        ...    ...
49995         False  False        False       True  False
49996         False  False        False       True  False
49997         False  False        False       True  False
49998         False  False        False      False  False
49999         False  False        False      False  False

[50000 rows x 5 columns]
**************************************************
       Manufacturer  Model  Engine size  Fuel type  Price
0             False   True        False      False   True
1              True   True        False      False   True
2              True   True        False       True  False
3             False  False        False       True  False
4             False  False        False      False  False
...             ...    ...          ...        ...    ...
49995         False  False        False       True  False
49996         False  False        False       True  False
49997         False  False        False       True  False
49998         False  False        False      False  False
49999         False  False        False      False  False

[50000 rows x 5 columns]

# Missing value
- load the Dataset => DataFrame
- Checking the misssing values => by using isna(),isnull()
- handle missing values =>

- ### df.isna() => if missing value => True
-           =>  if Value existing => False

In [3]:
import pandas as pd
df=pd.read_csv("/Users/apple/Downloads/car_sales_data copy.csv")
print(df.info())
print("*"*50)
print()
print(df.isna())
print("*"*50)
print("=> if you want know number of missing values number  ")
print()
print(df.isna().sum())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Manufacturer  49955 non-null  object
 1   Model         49940 non-null  object
 2   Engine size   49960 non-null  float64
 3   Fuel type     49919 non-null  object
 4   Price         49950 non-null  float64
dtypes: float64(2), object(3)
memory usage: 1.9+ MB
None
**************************************************

       Manufacturer  Model  Engine size  Fuel type  Price
0             False   True        False      False   True
1              True   True        False      False   True
2              True   True        False       True  False
3             False  False        False       True  False
4             False  False        False      False  False
...             ...    ...          ...        ...    ...
49995         False  False        False       True  False
49996         False  False        False       True  False
49997         False  False        False       True  False
49998         False  False        False      False  False
49999         False  False        False      False  False

[50000 rows x 5 columns]
**************************************************
=> if you want know number of missing values number

Manufacturer    45
Model           60
Engine size     40
Fuel type       81
Price           50
dtype: int64

In [110]:
import pandas as pd 
df=pd.read_csv("/Users/apple/Downloads/car_sales_data copy.csv")
print(df.info())
print("*"*50)
df1=df.isna()
print(df1.sum())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Manufacturer  49955 non-null  object
 1   Model         49940 non-null  object
 2   Engine size   49960 non-null  float64
 3   Fuel type     49919 non-null  object
 4   Price         49950 non-null  float64
dtypes: float64(2), object(3)
memory usage: 1.9+ MB
None
**************************************************
Manufacturer    45
Model           60
Engine size     40
Fuel type       81
Price           50
dtype: int64

### 4. notnull() method - checking NaN values
- notnull() is apredefined method in DataFrame
- We can access this method by using DataFrame object
- By using this method we can check missing Values exist in DataFrame or not
- if missing Values are available then it return as False otherwise True

In [2]:
import pandas as pd
df=pd.read_csv("/Users/apple/Downloads/car_sales_data copy.csv")
print(df.head())
print(df.notnull())

  Manufacturer Model  Engine size Fuel type    Price
0         Ford   NaN          1.0    Petrol      NaN
1          NaN   NaN          4.0    Petrol      NaN
2          NaN   NaN          1.6       NaN  24072.0
3       Toyota  RAV4          1.8       NaN   1705.0
4           VW  Polo          1.0    Petrol   4101.0
       Manufacturer  Model  Engine size  Fuel type  Price
0              True  False         True       True  False
1             False  False         True       True  False
2             False  False         True      False   True
3              True   True         True      False   True
4              True   True         True       True   True
...             ...    ...          ...        ...    ...
49995          True   True         True      False   True
49996          True   True         True      False   True
49997          True   True         True      False   True
49998          True   True         True       True   True
49999          True   True         True       True   True

[50000 rows x 5 columns]

In [4]:
# counting the missing values in each column with percentage
import pandas as pd
df=pd.read_csv("/Users/apple/Downloads/car_sales_data copy.csv")
s=df.isna().sum()
per=(s*100) / len(df)
print(per)

Manufacturer    0.090
Model           0.120
Engine size     0.080
Fuel type       0.162
Price           0.100
dtype: float64

### 5. Counting NaN values in column wise
- We can count number of missing values in DataFrame
- by using isna() and sum() method we can count the number of missing values in each column

In [3]:
import pandas as pd
df=pd.read_csv("/Users/apple/Downloads/car_sales_data copy.csv")
print(df.isna().sum())
print("*"*50)
df1=df.dropna()
print(df1.isna().sum())

Manufacturer    45
Model           60
Engine size     40
Fuel type       81
Price           50
dtype: int64
**************************************************
Manufacturer    0
Model           0
Engine size     0
Fuel type       0
Price           0
dtype: int64

In [4]:
# counting the missing values in each column with percentage
import pandas as pd
df=pd.read_csv("/Users/apple/Downloads/car_sales_data copy.csv")
s=df.isna().sum()
per=(s*100) / len(df)
print(per)

Manufacturer    0.090
Model           0.120
Engine size     0.080
Fuel type       0.162
Price           0.100
dtype: float64

## Realtime project
1. load the DataFrame
2. checking the missing values
   - column wise count
   - per wise
3. if conditon
   - no missing values in dataset
   - lise is happy]
   - we no need to handle
-   else
   - having missing values
   - we need to lean
   - how to handle missng...
3. a) no missing values => no need to handle
b) having missing values => learn how to handle

# df methods
- df.head()
- df.tail()
- df.info()
- df.count()
- df.describe()
- df.nuniue()
- df.rename()
- df.isna()
- df.isna().sum
# handling missing value
- df.dropna()  ---- imp 5*
- df.fillna()  ---- imp 3*
- df.replace()  ---- not imp

### 6.dropna() method - handling missing values
- dropna() is a predefined method in DataFrame
- We can access dropna() method by using DataFrame object
- This method drops the rows where at least one value is missing

In [6]:
# Dropping rows where NaN values existing 
import pandas as  pd
df=pd.read_csv("/Users/apple/Downloads/car_sales_data copy.csv")
print(df)
print("*"*50)
print(df.info())
print("*"*70)
print(df.isna().sum())
print("_"*70)
print(df.head(10))
print()
print("*"*70)
print(" => dropna")
df=df.dropna()
print("*"*70)
print(df)
print("*"*70)
print(df.info())
print("-"*70)
print(df.isna().sum())
print("-"*70)

      Manufacturer   Model  Engine size Fuel type     Price
0             Ford     NaN          1.0    Petrol       NaN
1              NaN     NaN          4.0    Petrol       NaN
2              NaN     NaN          1.6       NaN   24072.0
3           Toyota    RAV4          1.8       NaN    1705.0
4               VW    Polo          1.0    Petrol    4101.0
...            ...     ...          ...       ...       ...
49995          BMW      M5          5.0       NaN  113006.0
49996       Toyota   Prius          1.8       NaN    9430.0
49997         Ford  Mondeo          1.6       NaN   49852.0
49998         Ford   Focus          1.0    Diesel   23630.0
49999           VW    Golf          1.4    Diesel   10400.0

[50000 rows x 5 columns]
**************************************************
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Manufacturer  49955 non-null  object
 1   Model         49940 non-null  object
 2   Engine size   49960 non-null  float64
 3   Fuel type     49919 non-null  object
 4   Price         49950 non-null  float64
dtypes: float64(2), object(3)
memory usage: 1.9+ MB
None
**********************************************************************
Manufacturer    45
Model           60
Engine size     40
Fuel type       81
Price           50
dtype: int64
______________________________________________________________________
  Manufacturer  Model  Engine size Fuel type    Price
0         Ford    NaN          1.0    Petrol      NaN
1          NaN    NaN          4.0    Petrol      NaN
2          NaN    NaN          1.6       NaN  24072.0
3       Toyota   RAV4          1.8       NaN   1705.0
4           VW   Polo          1.0    Petrol   4101.0
5         Ford  Focus          1.4    Petrol  29204.0
6         Ford    NaN          1.8    Diesel  14350.0
7       Toyota  Prius          1.4    Hybrid  30297.0
8           VW   Polo          1.2    Petrol   9977.0
9         Ford  Focus          2.0    Diesel   1049.0

**********************************************************************
 => dropna
**********************************************************************
      Manufacturer   Model  Engine size Fuel type    Price
4               VW    Polo          1.0    Petrol   4101.0
5             Ford   Focus          1.4    Petrol  29204.0
7           Toyota   Prius          1.4    Hybrid  30297.0
8               VW    Polo          1.2    Petrol   9977.0
9             Ford   Focus          2.0    Diesel   1049.0
...            ...     ...          ...       ...      ...
49977           VW    Golf          1.4    Petrol  14083.0
49982         Ford  Mondeo          2.0    Hybrid   6407.0
49983           VW  Passat          1.8    Diesel   3987.0
49998         Ford   Focus          1.0    Diesel  23630.0
49999           VW    Golf          1.4    Diesel  10400.0

[49787 rows x 5 columns]
**********************************************************************
<class 'pandas.core.frame.DataFrame'>
Index: 49787 entries, 4 to 49999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Manufacturer  49787 non-null  object
 1   Model         49787 non-null  object
 2   Engine size   49787 non-null  float64
 3   Fuel type     49787 non-null  object
 4   Price         49787 non-null  float64
dtypes: float64(2), object(3)
memory usage: 2.3+ MB
None
----------------------------------------------------------------------
Manufacturer    0
Model           0
Engine size     0
Fuel type       0
Price           0
dtype: int64
----------------------------------------------------------------------

# to check missing values
- 3 type of methods
  1. df.isna() => using in realtime
  2. df.isnull() => not using in realtime
  3. df.notnull() => not using in realtime

In [ ]:
import pandas as pd
df=pd.read_csv("/Users/apple/Downloads/car_sales_data copy.csv")
print(df.isna().sum())
print("*"*50)
df1=df.dropna()
print(df1.isna().sum())

In [8]:
import pandas as pd
df=pd.read_csv("/Users/apple/Downloads/car_sales_data copy.csv")
print(df.isna().sum())
print("*"*50)
df1=df.dropna()
print(df1.isna().sum())
print("-"*50)
print(df1)

Manufacturer    45
Model           60
Engine size     40
Fuel type       81
Price           50
dtype: int64
**************************************************
Manufacturer    0
Model           0
Engine size     0
Fuel type       0
Price           0
dtype: int64
--------------------------------------------------
      Manufacturer   Model  Engine size Fuel type    Price
4               VW    Polo          1.0    Petrol   4101.0
5             Ford   Focus          1.4    Petrol  29204.0
7           Toyota   Prius          1.4    Hybrid  30297.0
8               VW    Polo          1.2    Petrol   9977.0
9             Ford   Focus          2.0    Diesel   1049.0
...            ...     ...          ...       ...      ...
49977           VW    Golf          1.4    Petrol  14083.0
49982         Ford  Mondeo          2.0    Hybrid   6407.0
49983           VW  Passat          1.8    Diesel   3987.0
49998         Ford   Focus          1.0    Diesel  23630.0
49999           VW    Golf          1.4    Diesel  10400.0

[49787 rows x 5 columns]

In [11]:
# Dropping rows where NaN values exiting and counting 
import pandas as pd
df=pd.read_csv("/Users/apple/Downloads/car_sales_data copy.csv")
df1=df.dropna()
print(df1.isna().sum())

Manufacturer    0
Model           0
Engine size     0
Fuel type       0
Price           0
dtype: int64

In [19]:
# Converting float column type int datatype
import pandas as pd
df=pd.read_csv("/Users/apple/Downloads/car_sales_data copy.csv")
print(df.head(10))
df1=df.dropna()
print("*"*50)
print(df.head(10))

  Manufacturer  Model  Engine size Fuel type    Price
0         Ford    NaN          1.0    Petrol      NaN
1          NaN    NaN          4.0    Petrol      NaN
2          NaN    NaN          1.6       NaN  24072.0
3       Toyota   RAV4          1.8       NaN   1705.0
4           VW   Polo          1.0    Petrol   4101.0
5         Ford  Focus          1.4    Petrol  29204.0
6         Ford    NaN          1.8    Diesel  14350.0
7       Toyota  Prius          1.4    Hybrid  30297.0
8           VW   Polo          1.2    Petrol   9977.0
9         Ford  Focus          2.0    Diesel   1049.0
**************************************************
   Manufacturer  Model  Engine size Fuel type    Price
4            VW   Polo          1.0    Petrol   4101.0
5          Ford  Focus          1.4    Petrol  29204.0
7        Toyota  Prius          1.4    Hybrid  30297.0
8            VW   Polo          1.2    Petrol   9977.0
9          Ford  Focus          2.0    Diesel   1049.0
10           VW   Golf          2.0    Diesel  17173.0
11          BMW     Z4          2.0    Petrol    719.0
12           VW   Golf          1.2    Diesel   7792.0
13       Toyota   RAV4          2.2    Petrol  16026.0
14       Toyota  Yaris          1.4    Petrol   4046.0
<class 'pandas.core.frame.DataFrame'>

In [46]:
#### Converting float column type int datatype
import pandas as pd
df=pd.read_csv('/Users/apple/Downloads/car_sales_data copy.csv')
print(df.head(10))
print("_"*55)
df1=df.dropna()
df5=df1[["Price","Engine size"]]
print(df1.head(10))
print("*"*50)
print("*"*50)
print(df1)
print("*"*50)
print("Converting float column type to  int datatype ")
print(df5)
print("_"*40)
df3=df1[["Price","Engine size"]]
df4=df3.astype(int)
print(df4)

  Manufacturer  Model  Engine size Fuel type    Price
0         Ford    NaN          1.0    Petrol      NaN
1          NaN    NaN          4.0    Petrol      NaN
2          NaN    NaN          1.6       NaN  24072.0
3       Toyota   RAV4          1.8       NaN   1705.0
4           VW   Polo          1.0    Petrol   4101.0
5         Ford  Focus          1.4    Petrol  29204.0
6         Ford    NaN          1.8    Diesel  14350.0
7       Toyota  Prius          1.4    Hybrid  30297.0
8           VW   Polo          1.2    Petrol   9977.0
9         Ford  Focus          2.0    Diesel   1049.0
_______________________________________________________
   Manufacturer  Model  Engine size Fuel type    Price
4            VW   Polo          1.0    Petrol   4101.0
5          Ford  Focus          1.4    Petrol  29204.0
7        Toyota  Prius          1.4    Hybrid  30297.0
8            VW   Polo          1.2    Petrol   9977.0
9          Ford  Focus          2.0    Diesel   1049.0
10           VW   Golf          2.0    Diesel  17173.0
11          BMW     Z4          2.0    Petrol    719.0
12           VW   Golf          1.2    Diesel   7792.0
13       Toyota   RAV4          2.2    Petrol  16026.0
14       Toyota  Yaris          1.4    Petrol   4046.0
**************************************************
**************************************************
      Manufacturer   Model  Engine size Fuel type    Price
4               VW    Polo          1.0    Petrol   4101.0
5             Ford   Focus          1.4    Petrol  29204.0
7           Toyota   Prius          1.4    Hybrid  30297.0
8               VW    Polo          1.2    Petrol   9977.0
9             Ford   Focus          2.0    Diesel   1049.0
...            ...     ...          ...       ...      ...
49977           VW    Golf          1.4    Petrol  14083.0
49982         Ford  Mondeo          2.0    Hybrid   6407.0
49983           VW  Passat          1.8    Diesel   3987.0
49998         Ford   Focus          1.0    Diesel  23630.0
49999           VW    Golf          1.4    Diesel  10400.0

[49787 rows x 5 columns]
**************************************************
Converting float column type to  int datatype
         Price  Engine size
4       4101.0          1.0
5      29204.0          1.4
7      30297.0          1.4
8       9977.0          1.2
9       1049.0          2.0
...        ...          ...
49977  14083.0          1.4
49982   6407.0          2.0
49983   3987.0          1.8
49998  23630.0          1.0
49999  10400.0          1.4

[49787 rows x 2 columns]
________________________________________
       Price  Engine size
4       4101            1
5      29204            1
7      30297            1
8       9977            1
9       1049            2
...      ...          ...
49977  14083            1
49982   6407            2
49983   3987            1
49998  23630            1
49999  10400            1

[49787 rows x 2 columns]

# Handling missing values
1. Get Dataset from client
2. load the Dataset
    - DataFrame
    - apply method
- loading the dataset
- checking the missing values
  - df.isna()
  - df.isna().sum()
- How to handle
  - df.dropna()

In [50]:
#### Converting float column type int datatype
import pandas as pd
df=pd.read_csv('/Users/apple/Downloads/car_sales_data copy.csv')
print(df.head(10))
print("_"*40)
print("Converting float column type to  int datatype ")
print("_"*40)
df=df.dropna()
df3=df[["Price","Engine size"]]
df4=df3.astype(int)
print(df4)

  Manufacturer  Model  Engine size Fuel type    Price
0         Ford    NaN          1.0    Petrol      NaN
1          NaN    NaN          4.0    Petrol      NaN
2          NaN    NaN          1.6       NaN  24072.0
3       Toyota   RAV4          1.8       NaN   1705.0
4           VW   Polo          1.0    Petrol   4101.0
5         Ford  Focus          1.4    Petrol  29204.0
6         Ford    NaN          1.8    Diesel  14350.0
7       Toyota  Prius          1.4    Hybrid  30297.0
8           VW   Polo          1.2    Petrol   9977.0
9         Ford  Focus          2.0    Diesel   1049.0
________________________________________
Converting float column type to  int datatype
________________________________________
       Price  Engine size
4       4101            1
5      29204            1
7      30297            1
8       9977            1
9       1049            2
...      ...          ...
49977  14083            1
49982   6407            2
49983   3987            1
49998  23630            1
49999  10400            1

[49787 rows x 2 columns]

### 7. dropna(inplace = True) method handling missing vales
- dropna(inplce = True ) is a predefined method in DataFrame
- We can access this method by using DataFrame object
- This method drop the rows and perform changes on existing DataFrame.

In [59]:
#(dropna() with inplace parameter)
import pandas as pd
df=pd.read_csv('/Users/apple/Downloads/car_sales_data.csv')
df1=df[["Engine size","Price"]]
df1.dropna(inplace=True)
print(df1)

       Engine size   Price
0              1.0    3074
1              4.0   49704
2              1.6   24072
3              1.8    1705
4              1.0    4101
...            ...     ...
49995          5.0  113006
49996          1.8    9430
49997          1.6   49852
49998          1.0   23630
49999          1.4   10400

[50000 rows x 2 columns]

/var/folders/49/yg3wsvdd3f58h2tww9p8yrn80000gn/T/ipykernel_23238/2747709341.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1.dropna(inplace=True)

### 8.fillna() method - handling missing valuaes
- fillna() is a predefined method in DataFrame
- We can access this method by using DataFrame object
- by using this method we can fill missing/NaN values with specific value.
  1. fillna(0)=> This method fill NaN with Zero values
  2. fillna(number)=> This method fill NaN with number

In [66]:
import pandas as pd
df=pd.read_csv('/Users/apple/Downloads/car_sales_data copy.csv')
print(df)
print("*"*70)
df1=df.fillna(0)
print(df1)

      Manufacturer   Model  Engine size Fuel type     Price
0             Ford     NaN          1.0    Petrol       NaN
1              NaN     NaN          4.0    Petrol       NaN
2              NaN     NaN          1.6       NaN   24072.0
3           Toyota    RAV4          1.8       NaN    1705.0
4               VW    Polo          1.0    Petrol    4101.0
...            ...     ...          ...       ...       ...
49995          BMW      M5          5.0       NaN  113006.0
49996       Toyota   Prius          1.8       NaN    9430.0
49997         Ford  Mondeo          1.6       NaN   49852.0
49998         Ford   Focus          1.0    Diesel   23630.0
49999           VW    Golf          1.4    Diesel   10400.0

[50000 rows x 5 columns]
**********************************************************************
      Manufacturer   Model  Engine size Fuel type     Price
0             Ford       0          1.0    Petrol       0.0
1                0       0          4.0    Petrol       0.0
2                0       0          1.6         0   24072.0
3           Toyota    RAV4          1.8         0    1705.0
4               VW    Polo          1.0    Petrol    4101.0
...            ...     ...          ...       ...       ...
49995          BMW      M5          5.0         0  113006.0
49996       Toyota   Prius          1.8         0    9430.0
49997         Ford  Mondeo          1.6         0   49852.0
49998         Ford   Focus          1.0    Diesel   23630.0
49999           VW    Golf          1.4    Diesel   10400.0

[50000 rows x 5 columns]

# =>handling missing values        => we are taking help from methods
1. df.isna()
2. df.isna().sum()
3. df.dropna()
4. df.dropna(inplace=True)

In [71]:
import pandas as pd
df=pd.read_csv('/Users/apple/Downloads/car_sales_data copy.csv')
print(df.isna().sum())
df1=df
df2=df1.fillna(0)
print("*"*50)
print(df2.isna().sum())

Manufacturer    45
Model           60
Engine size     40
Fuel type       81
Price           50
dtype: int64
**************************************************
Manufacturer    0
Model           0
Engine size     0
Fuel type       0
Price           0
dtype: int64

In [83]:
# Filling NAN values with specific Values
import pandas as pd
import numpy  as np
data=[
    ["Rajan",26,40000],
    ["Daniel",16,20000],
    ["Veeru",45,900000],
    ["Venkat",None,450000],
    ["Sumanth",20,950000],
    ["Shafi",None,97000]
]
c=["Name","Age","Salary"]
df=pd.DataFrame(data,columns=c)
print(df)
print("*"*50)
df1=df.fillna(28)
print(df1)

      Name   Age  Salary
0    Rajan  26.0   40000
1   Daniel  16.0   20000
2    Veeru  45.0  900000
3   Venkat   NaN  450000
4  Sumanth  20.0  950000
5    Shafi   NaN   97000
**************************************************
      Name   Age  Salary
0    Rajan  26.0   40000
1   Daniel  16.0   20000
2    Veeru  45.0  900000
3   Venkat  28.0  450000
4  Sumanth  20.0  950000
5    Shafi  28.0   97000

In [100]:
# Filling NAN values with specific Values
import pandas as pd
import numpy  as np
data=[
    ["Rajan",26,40000],
    ["Daniel",16,20000],
    ["Veeru",45,900000],
    ["Venkat",None,450000],
    ["Sumanth",20,950000],
    ["Shafi",None,97000]
]
c=["Name","Age","Salary"]
df=pd.DataFrame(data,columns=c)
df1=df
print(df1["Age"])
print("*"*40)
print("=> Sum = ",df1["Age"].sum())
print("*"*40)
print("=> mean = ",df1["Age"].mean())
print("*"*40)
print("=> median =",df1["Age"].median())
print("*"*40)
m=df1["Age"].median()
df2=df1.fillna(m)
print(df1)
print("*"*40)
print(df2)

0    26.0
1    16.0
2    45.0
3     NaN
4    20.0
5     NaN
Name: Age, dtype: float64
****************************************
=> Sum =  107.0
****************************************
=> mean =  26.75
****************************************
=> median = 23.0
****************************************
      Name   Age  Salary
0    Rajan  26.0   40000
1   Daniel  16.0   20000
2    Veeru  45.0  900000
3   Venkat   NaN  450000
4  Sumanth  20.0  950000
5    Shafi   NaN   97000
****************************************
      Name   Age  Salary
0    Rajan  26.0   40000
1   Daniel  16.0   20000
2    Veeru  45.0  900000
3   Venkat  23.0  450000
4  Sumanth  20.0  950000
5    Shafi  23.0   97000

In [106]:
# Filling NAN values with specific sstring 
import pandas as pd
import numpy  as np
data=[
    ["Rajan",26,40000],
    ["Daniel",16,20000],
    ["Veeru",45,900000],
    [np.nan,23,450000],
    ["Sumanth",20,950000],
    [np.nan,23,97000]
]
c=["Name","Age","Salary"]
df=pd.DataFrame(data,columns=c)
print(df)
df2=df.fillna("unknown")
print("*"*40)
print(df2)

      Name  Age  Salary
0    Rajan   26   40000
1   Daniel   16   20000
2    Veeru   45  900000
3      NaN   23  450000
4  Sumanth   20  950000
5      NaN   23   97000
****************************************
      Name  Age  Salary
0    Rajan   26   40000
1   Daniel   16   20000
2    Veeru   45  900000
3  unknown   23  450000
4  Sumanth   20  950000
5  unknown   23   97000

# =>handling missing values        => we are taking help from methods
1. df.isna()
2. df.isna().sum()
3. df.dropna()
4. df.dropna(inplace=True)
5. df.["Age"].mean(),median(),sum========df.Age.mean()====df.Age.median
6. df.fillna()

In [109]:
import pandas as pd
import numpy  as np
data=[
    ["Rajan",np.nan,40000],
    ["Daniel",16,20000],
    ["Veeru",45,900000],
    ["Venkat",np.nan,450000],
    ["Sumanth",20,950000],
    ["Shafi",np.nan,97000]
]
c=["Name","Age","Salary"]
df=pd.DataFrame(data,columns=c)
df1=df
df2=df.replace(np.nan,0)
print(df1)
print("*"*30)
print(df2)

      Name   Age  Salary
0    Rajan   NaN   40000
1   Daniel  16.0   20000
2    Veeru  45.0  900000
3   Venkat   NaN  450000
4  Sumanth  20.0  950000
5    Shafi   NaN   97000
******************************
      Name   Age  Salary
0    Rajan   0.0   40000
1   Daniel  16.0   20000
2    Veeru  45.0  900000
3   Venkat   0.0  450000
4  Sumanth  20.0  950000
5    Shafi   0.0   97000

# summary
- df => name of the dataFrame
- df.drop()
- df.fillna()
- df.replace(p1,p2)